apache/nuttx/arch/renesas/src/rx65n/rx65n_sci.c
/****************************************************************************
 * arch/renesas/src/rx65n/rx65n_sci.c
 *
 *   Copyright (C) 2008-2019 Gregory Nutt. All rights reserved.
 *   Author: Anjana <anjana@tataelxsi.co.in>
 *
 * Redistribution and use in source and binary forms, with or without
 * modification, are permitted provided that the following conditions
 * are met:
 *
 * 1. Redistributions of source code must retain the above copyright
 *    notice, this list of conditions and the following disclaimer.
 * 2. Redistributions in binary form must reproduce the above copyright
 *    notice, this list of conditions and the following disclaimer in
 *    the documentation and/or other materials provided with the
 *    distribution.
 * 3. Neither the name NuttX nor the names of its contributors may be
 *    used to endorse or promote products derived from this software
 *    without specific prior written permission.
 *
 * THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS
 * "AS IS" AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT
 * LIMITED TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS
 * FOR A PARTICULAR PURPOSE ARE DISCLAIMED. IN NO EVENT SHALL THE
 * COPYRIGHT OWNER OR CONTRIBUTORS BE LIABLE FOR ANY DIRECT, INDIRECT,
 * INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING,
 * BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS
 * OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED
 * AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
 * LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN
 * ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE
 * POSSIBILITY OF SUCH DAMAGE.
 *
 ****************************************************************************/

/****************************************************************************
 * Included Files
 ****************************************************************************/

#include <nuttx/config.h>
#include "sys/types.h"
#include "rx65n_macrodriver.h"
#include "rx65n_sci.h"
#include "chip.h"
#include "up_arch.h"
#include "up_internal.h"
#include "rx65n_definitions.h"

/****************************************************************************
 * Public Data
 ****************************************************************************/

#ifdef CONFIG_RX65N_SCI0
/* SCI0 transmit buffer address */

volatile uint8_t *gp_sci0_tx_address;

/* SCI0 receive buffer address */

volatile uint8_t *gp_sci0_rx_address;

/* SCI0 transmit data number */

volatile uint16_t g_sci0_tx_count;

/* SCI0 receive data number */

volatile uint16_t g_sci0_rx_count;

/* SCI0 receive data length */

volatile uint16_t g_sci0_rx_length;
#endif

#ifdef CONFIG_RX65N_SCI1
/* SCI1 transmit buffer address */

volatile uint8_t *gp_sci1_tx_address;

/* SCI1 receive buffer address */

volatile uint8_t *gp_sci1_rx_address;

/* SCI1 transmit data number */

volatile uint16_t g_sci1_tx_count;

/* SCI1 receive data number */

volatile uint16_t g_sci1_rx_count;

/* SCI1 receive data length */

volatile uint16_t g_sci1_rx_length;
#endif

#ifdef CONFIG_RX65N_SCI2
/* SCI2 transmit buffer address */

volatile uint8_t *gp_sci2_tx_address;

/* SCI2 receive buffer address  */

volatile uint8_t *gp_sci2_rx_address;

/* SCI2 transmit data number   */

volatile uint16_t g_sci2_tx_count;

/* SCI2 receive data number */

volatile uint16_t g_sci2_rx_count;

/* SCI2 receive data length */

volatile uint16_t g_sci2_rx_length;
#endif

#ifdef CONFIG_RX65N_SCI3
/* SCI3 transmit buffer address */

volatile uint8_t *gp_sci3_tx_address;

/* SCI3 receive buffer address */

volatile uint8_t *gp_sci3_rx_address;

/* SCI3 transmit data number */

volatile uint16_t g_sci3_tx_count;

/* SCI3 receive data number */

volatile uint16_t g_sci3_rx_count;

/* SCI3 receive data length */

volatile uint16_t g_sci3_rx_length;
#endif

#ifdef CONFIG_RX65N_SCI4
/* SCI4 transmit buffer address */

volatile uint8_t *gp_sci4_tx_address;

/* SCI4 receive buffer address */

volatile uint8_t *gp_sci4_rx_address;

/* SCI4 transmit data number */

volatile uint16_t g_sci4_tx_count;

/* SCI4 receive data number */

volatile uint16_t g_sci4_rx_count;

/* SCI4 receive data length */

volatile uint16_t g_sci4_rx_length;
#endif

#ifdef CONFIG_RX65N_SCI5
/* SCI5 transmit buffer address */

volatile uint8_t *gp_sci5_tx_address;

/* SCI5 receive buffer address */

volatile uint8_t *gp_sci5_rx_address;

/* SCI5 transmit data number */

volatile uint16_t g_sci5_tx_count;

/* SCI5 receive data number */

volatile uint16_t g_sci5_rx_count;

/* SCI5 receive data length */

volatile uint16_t g_sci5_rx_length;
#endif

#ifdef CONFIG_RX65N_SCI6

/* SCI6 transmit buffer address */

volatile uint8_t *gp_sci6_tx_address;

/* SCI6 receive buffer address */

volatile uint8_t *gp_sci6_rx_address;

/* SCI6 transmit data number */

volatile uint16_t g_sci6_tx_count;

/* SCI6 receive data number */

volatile uint16_t g_sci6_rx_count;

/* SCI6 receive data length */

volatile uint16_t g_sci6_rx_length;
#endif

#ifdef CONFIG_RX65N_SCI7

/* SCI7 transmit buffer address */

volatile uint8_t *gp_sci7_tx_address;

/* SCI7 receive buffer address */

volatile uint8_t *gp_sci7_rx_address;

/* SCI7 transmit data number */

volatile uint16_t g_sci7_tx_count;

/* SCI7 receive data number */

volatile uint16_t g_sci7_rx_count;

/* SCI7 receive data length */

volatile uint16_t g_sci7_rx_length;
#endif

#ifdef CONFIG_RX65N_SCI8
/* SCI8 transmit buffer address */

volatile uint8_t *gp_sci8_tx_address;

/* SCI8 receive buffer address  */

volatile uint8_t *gp_sci8_rx_address;

/* SCI8 transmit data number  */

volatile uint16_t g_sci8_tx_count;

/* SCI8 receive data number */

volatile uint16_t g_sci8_rx_count;

/* SCI8 receive data length */

volatile uint16_t g_sci8_rx_length;
#endif

#ifdef CONFIG_RX65N_SCI9
/* SCI9 transmit buffer address */

volatile uint8_t *gp_sci9_tx_address;

/* SCI9 receive buffer address */

volatile uint8_t *gp_sci9_rx_address;

/* SCI9 transmit data number */

volatile uint16_t g_sci9_tx_count;

/* SCI9 receive data number */

volatile uint16_t g_sci9_rx_count;

/* SCI9 receive data length */

volatile uint16_t g_sci9_rx_length;
#endif

#ifdef CONFIG_RX65N_SCI10
/* SCI10 transmit buffer address */

