apache/nuttx/arch/renesas/src/rx65n/rx65n_sci.c
volatile uint8_t *gp_sci10_tx_address;

/* SCI10 receive buffer address */

volatile uint8_t *gp_sci10_rx_address;

/* SCI10 transmit data number */

volatile uint16_t g_sci10_tx_count;

/* SCI10 receive data number */

volatile uint16_t g_sci10_rx_count;

/* SCI10 receive data length */

volatile uint16_t g_sci10_rx_length;
#endif

#ifdef CONFIG_RX65N_SCI11
/* SCI11 transmit buffer address */

volatile uint8_t *gp_sci11_tx_address;

/* SCI11 receive buffer address */

volatile uint8_t *gp_sci11_rx_address;

/* SCI11 transmit data number */

volatile uint16_t g_sci11_tx_count;

/* SCI11 receive data number */

volatile uint16_t g_sci11_rx_count;

/* SCI11 receive data length */

volatile uint16_t g_sci11_rx_length;
#endif

#ifdef CONFIG_RX65N_SCI12
/* SCI12 transmit buffer address */

volatile uint8_t *gp_sci12_tx_address;

/* SCI12 receive buffer address */

volatile uint8_t *gp_sci12_rx_address;

/* SCI12 transmit data number */

volatile uint16_t g_sci12_tx_count;

/* SCI12 receive data number */

volatile uint16_t g_sci12_rx_count;

/* SCI12 receive data length */

volatile uint16_t g_sci12_rx_length;
#endif

/****************************************************************************
 * Public Functions
 ****************************************************************************/

/****************************************************************************
 * Name: rx_mpc_enable
 *
 * Description:
 * Enable writing to registers
 ****************************************************************************/

static inline void rx_mpc_enable(void)
{
/* Enable writing to registers related to operating modes,
 * LPC, CGC and software reset
 */

  SYSTEM.PRCR.WORD = 0xa50bu;

  /* Enable writing to MPC pin function control registers */

  MPC.PWPR.BIT.B0WI = 0u;
  MPC.PWPR.BIT.PFSWE = 1u;
}

/****************************************************************************
 * Name: rx_mpc_disable
 *
 * Description:
 * Disable writing to registers
 ****************************************************************************/

static inline void rx_mpc_disable(void)
{
  /* Disable writing to MPC pin function control registers */

  MPC.PWPR.BIT.PFSWE = 0u;
  MPC.PWPR.BIT.B0WI = 1u;

  /* Enable protection */

  SYSTEM.PRCR.WORD = 0xa500u;
}

/****************************************************************************
 * Name: sci0_init_port
 *
 * Description:
 * SCI0 Initialization
 ****************************************************************************/

#ifdef CONFIG_RX65N_SCI0
static inline void sci0_init_port(void)
{
#ifdef CONFIG_ARCH_BOARD_RX65N_GRROSE
  /* Set RXD0 pin (P21) */

  MPC.P21PFS.BYTE   = 0x0au;
  PORT2.PMR.BIT.B1  = 1u;

  /* Set TXD0 pin (P20) */

  PORT2.PODR.BIT.BT0 = 1u;
  MPC.P20PFS.BYTE    = 0x0au;
  PORT2.PDR.BIT.BT0  = 1u;
  PORT2.PMR.BIT.BT0  = 1u;
#endif /* CONFIG_ARCH_BOARD_RX65N_GRROSE */
}
#endif

/****************************************************************************
 * Name: sci1_init_port
 *
 * Description:
 * SCI1 Initialization
 ****************************************************************************/

#ifdef CONFIG_RX65N_SCI1
static inline void sci1_init_port(void)
{
#ifdef CONFIG_ARCH_BOARD_RX65N_RSK2MB
  /* Set RXD1 pin (PF2) */

  MPC.PF2PFS.BYTE   = 0x0au;
  PORTF.PMR.BIT.B2  = 1u;

  /* Set TXD1 pin (PF1) */

  PORTF.PODR.BIT.B1 = 1u;
  MPC.PF1PFS.BYTE   = 0x0au;
  PORTF.PDR.BIT.B1  = 1u;
  PORTF.PMR.BIT.B1  = 1u;

#endif /* CONFIG_ARCH_BOARD_RX65N_RSK2MB */

#ifdef CONFIG_ARCH_BOARD_RX65N_GRROSE
  /* Set RXD1 pin (P30) */

  MPC.P30PFS.BYTE   = 0x0au;
  PORT3.PMR.BIT.BT0 = 1u;

  /* Set TXD1 pin (P26) */

  PORT2.PODR.BIT.B6 = 1u;
  MPC.P26PFS.BYTE   = 0x0au;
  PORT2.PDR.BIT.B6  = 1u;
  PORT2.PMR.BIT.B6  = 1u;
#endif /* CONFIG_ARCH_BOARD_RX65N_GRROSE */
}
#endif

/****************************************************************************
 * Name: sci2_init_port
 *
 * Description:
 * SCI2 Initialization
 ****************************************************************************/

#ifdef CONFIG_RX65N_SCI2
static inline void sci2_init_port(void)
{
#ifdef CONFIG_ARCH_BOARD_RX65N_RSK1MB
  /* Set RXD2 pin (P52) */

  MPC.P52PFS.BYTE  = 0x0au;
  PORT5.PMR.BIT.B2 = 1u;

  /* Set TXD2 pin (P50) */

  PORT5.PODR.BIT.BT0 = 1u;
  MPC.P50PFS.BYTE    = 0x0au;
  PORT5.PDR.BIT.BT0  = 1u;
  PORT5.PMR.BIT.BT0  = 1u;
#endif /* CONFIG_ARCH_BOARD_RX65N_RSK1MB */

#ifdef CONFIG_ARCH_BOARD_RX65N_RSK2MB
  /* Set RXD2 pin (P52) */

  MPC.P52PFS.BYTE   = 0x0au;
  PORT5.PMR.BIT.B2  = 1u;

  /* Set TXD2 pin (P50) */

  PORT5.PODR.BIT.BT0 = 1u;
  MPC.P50PFS.BYTE    = 0x0au;
  PORT5.PDR.BIT.BT0  = 1u;
  PORT5.PMR.BIT.BT0  = 1u;
#endif /* CONFIG_ARCH_BOARD_RX65N_RSK2MB */

#ifdef CONFIG_ARCH_BOARD_RX65N_GRROSE
  /* Set RXD2 pin (P12) */

  MPC.P12PFS.BYTE  = 0x0au;
  PORT1.PMR.BIT.B2 = 1u;

  /* Set TXD2 pin (P13) */

  PORT1.PODR.BIT.B3  = 1u;
  MPC.P13PFS.BYTE    = 0x0au;
  PORT1.PDR.BIT.B3   = 1u;
  PORT1.PMR.BIT.B3   = 1u;
#endif /* CONFIG_ARCH_BOARD_RX65N_GRROSE */
}
#endif

/****************************************************************************
 * Name: sci3_init_port
 *
 * Description:
 * SCI3 Initialization
 ****************************************************************************/

#ifdef CONFIG_RX65N_SCI3
static inline void sci3_init_port(void)
{
  /* Set RXD3 pin (PXX)
   * MPC.PXXPFS.BYTE = 0x0au;
   * PORTX.PMR.BIT.BX = 1u;
   * Set TXD3 pin (PXX)
   * PORTX.PODR.BIT.BX = 1u;
   * MPC.PXXPFS.BYTE   = 0x0au;
   * PORTX.PDR.BIT.BX  = 1u;
   * PORTX.PMR.BIT.BX  = 1u;
   */

#ifdef CONFIG_ARCH_BOARD_RX65N_GRROSE
  /* Set RXD2 pin (P25) */

  MPC.P25PFS.BYTE  = 0x0au;
  PORT2.PMR.BIT.B5 = 1u;

  /* Set TXD2 pin (P23) */

  PORT2.PODR.BIT.B3  = 1u;
  MPC.P23PFS.BYTE    = 0x0au;
  PORT2.PDR.BIT.B3   = 1u;
  PORT2.PMR.BIT.B3   = 1u;
#endif /* CONFIG_ARCH_BOARD_RX65N_GRROSE */
}
#endif

/****************************************************************************
 * Name: sci4_init_port
 *
 * Description:
 * SCI4 Initialization
 ****************************************************************************/

