apache/nuttx/arch/renesas/src/rx65n/rx65n_sci.c
#ifdef CONFIG_RX65N_SCI4
static inline void sci4_init_port(void)
{
  /* Set RXD4 pin (PXX)
   * MPC.PXXPFS.BYTE = 0x0au;
   * PORTX.PMR.BIT.BX = 1u;
   * Set TXD4 pin (PXX)
   * PORTX.PODR.BIT.BX = 1u;
   * MPC.PXXPFS.BYTE   = 0x0au;
   * PORTX.PDR.BIT.BX = 1u;
   * PORTX.PMR.BIT.BX = 1u;
   */
}
#endif

/****************************************************************************
 * Name: sci5_init_port
 *
 * Description:
 * SCI5 Initialization
 ****************************************************************************/

#ifdef CONFIG_RX65N_SCI5
static inline void sci5_init_port(void)
{
#ifdef CONFIG_ARCH_BOARD_RX65N_GRROSE

  /* Set RXD3 pin (PC2) */

  MPC.PC2PFS.BYTE  = 0x0au;
  PORTC.PMR.BIT.B2 = 1u;

  /* Set TXD3 pin (PC3) */

  PORTC.PODR.BIT.B3 = 1u;
  MPC.PC3PFS.BYTE   = 0x0au;
  PORTC.PDR.BIT.B3  = 1u;
  PORTC.PMR.BIT.B3  = 1u;
#endif /* CONFIG_ARCH_BOARD_RX65N_GRROSE */
}
#endif

/****************************************************************************
 * Name: sci6_init_port
 *
 * Description:
 * SCI6 Initialization
 ****************************************************************************/

#ifdef CONFIG_RX65N_SCI6
static inline void sci6_init_port(void)
{
#ifdef CONFIG_ARCH_BOARD_RX65N_GRROSE

  /* Set RXD6 pin (P33) */

  MPC.P33PFS.BYTE  = 0x0au;
  PORT3.PMR.BIT.B3 = 1u;

  /* Set TXD6 pin (P32) */

  PORT3.PODR.BIT.B2 = 1u;
  MPC.P32PFS.BYTE   = 0x0au;
  PORT3.PDR.BIT.B2  = 1u;
  PORT3.PMR.BIT.B2  = 1u;
#endif /* CONFIG_ARCH_BOARD_RX65N_GRROSE */
}
#endif

/****************************************************************************
 * Name: sci7_init_port
 *
 * Description:
 * SCI7 Initialization
 ****************************************************************************/

#ifdef CONFIG_RX65N_SCI7
static inline void sci7_init_port(void)
{
  /* Set RXD7 pin (PXX)
   * MPC.PXXPFS.BYTE = 0x0au;
   * PORTX.PMR.BIT.BX = 1u;
   * Set TXD7 pin (PXX)
   * PORTX.PODR.BIT.BX = 1u;
   * MPC.PXXPFS.BYTE   = 0x0au;
   * PORTX.PDR.BIT.BX = 1u;
   * PORTX.PMR.BIT.BX = 1u;
   */
}
#endif

/****************************************************************************
 * Name: sci8_init_port
 *
 * Description:
 * SCI8 Initialization
 ****************************************************************************/

#ifdef CONFIG_RX65N_SCI8
static inline void sci8_init_port(void)
{
#ifdef CONFIG_ARCH_BOARD_RX65N_RSK2MB
  /* Set RXD8 pin (PJ1) */

  MPC.PJ1PFS.BYTE  = 0x0au;
  PORTJ.PMR.BIT.B1 = 1u;

  /* Set TXD8 pin (PJ2) */

  PORTJ.PODR.BIT.B2 = 1u;
  MPC.PJ2PFS.BYTE   = 0x0au;
  PORTJ.PDR.BIT.B2  = 1u;
  PORTJ.PMR.BIT.B2  = 1u;
#endif /* CONFIG_ARCH_BOARD_RX65N_RSK2MB */

#ifdef CONFIG_ARCH_BOARD_RX65N_GRROSE
  /* Set RXD8 pin (PC6) */

  MPC.PC6PFS.BYTE  = 0x0au;
  PORTC.PMR.BIT.B6 = 1u;

  /* Set TXD8 pin (PC7) */

  PORTC.PODR.BIT.B7 = 1u;
  MPC.PC7PFS.BYTE   = 0x0au;
  PORTC.PDR.BIT.B7  = 1u;
  PORTC.PMR.BIT.B7  = 1u;
#endif /* CONFIG_ARCH_BOARD_RX65N_GRROSE */
}
#endif

/****************************************************************************
 * Name: sci9_init_port
 *
 * Description:
 * SCI9 Initialization
 ****************************************************************************/

#ifdef CONFIG_RX65N_SCI9
static inline void sci9_init_port(void)
{
  /* Set RXD9 pin (PXX)
   * MPC.PXXPFS.BYTE = 0x0au;
   * PORTX.PMR.BIT.BX = 1u;
   * Set TXD9 pin (PXX)
   * PORTX.PODR.BIT.BX = 1u;
   * MPC.PXXPFS.BYTE   = 0x0au;
   * PORTX.PDR.BIT.BX = 1u;
   * PORTX.PMR.BIT.BX = 1u;
   */
}
#endif

/****************************************************************************
 * Name: sci10_init_port
 *
 * Description:
 * SCI10 Initialization
 ****************************************************************************/

#ifdef CONFIG_RX65N_SCI10
static inline void sci10_init_port(void)
{
  /* Set RXD10 pin (PXX)
   * MPC.PXXPFS.BYTE = 0x0au;
   * PORTX.PMR.BIT.BX = 1u;
   * Set TXD10 pin (PXX)
   * PORTX.PODR.BIT.BX = 1u;
   * MPC.PXXPFS.BYTE   = 0x0au;
   * PORTX.PDR.BIT.BX = 1u;
   * PORTX.PMR.BIT.BX = 1u;
   */
}
#endif

/****************************************************************************
 * Name: sci11_init_port
 *
 * Description:
 * SCI11 Initialization
 ****************************************************************************/

#ifdef CONFIG_RX65N_SCI11
static inline void sci11_init_port(void)
{
  /* Set RXD11 pin (PXX)
   * MPC.PXXPFS.BYTE = 0x0au;
   * PORTX.PMR.BIT.BX = 1u;
   * Set TXD11 pin (PXX)
   * PORTX.PODR.BIT.BX = 1u;
   * MPC.PXXPFS.BYTE   = 0x0au;
   * PORTX.PDR.BIT.BX = 1u;
   * PORTX.PMR.BIT.BX = 1u;
   */
}
#endif

/****************************************************************************
 * Name: sci12_init_port
 *
 * Description:
 * SCI12 Initialization
 ****************************************************************************/

#ifdef CONFIG_RX65N_SCI12
static inline void sci12_init_port(void)
{
#ifdef CONFIG_ARCH_BOARD_RX65N_RSK2MB

  /* Set RXD12 pin */

  MPC.PE2PFS.BYTE = 0x0cu;
  PORTE.PMR.BYTE |= 0x04u;

  /* Set TXD12 pin */

  PORTE.PODR.BYTE |= 0x02u;
  MPC.PE1PFS.BYTE = 0x0cu;
  PORTE.PDR.BYTE |= 0x02u;
#endif

  /* Set RXD12 pin (PXX)
   * MPC.PXXPFS.BYTE = 0x0au;
   * PORTX.PMR.BIT.BX = 1u;
   * Set TXD12 pin (PXX)
   * PORTX.PODR.BIT.BX = 1u;
   * MPC.PXXPFS.BYTE   = 0x0au;
   * PORTX.PDR.BIT.BX = 1u;
   * PORTX.PMR.BIT.BX = 1u;
   */
}
#endif

/****************************************************************************
 * Name: r_sci0_create
 *
 * Description:
 * SCI0 Initialization
 ****************************************************************************/

#ifdef CONFIG_RX65N_SCI0
void r_sci0_create(void)
{
  rx_mpc_enable();
  MSTP(SCI0)      = 0u;                  /* Cancel SCI0 module stop state */
  IPR(SCI0, RXI0) = 15;                  /* Set interrupt priority */
  IPR(SCI0, TXI0) = 15;                  /* Set interrupt priority */
  SCI0.SCR.BYTE   = 0u;                  /* Clear the control register */

  /* Set clock enable */

  SCI0.SCR.BYTE  = _00_SCI_INTERNAL_SCK_UNUSED;
  SCI0.SIMR1.BIT.IICM   = 0u;                   /* Clear SIMR1.IICM bit */
  SCI0.SPMR.BIT.CKPH    = 0u;                   /* Clear SPMR.CKPH bit */
  SCI0.SPMR.BIT.CKPOL   = 0u;                   /* Clear SPMR.CKPOL bit */

  /* Set control registers */

  SCI0.SPMR.BYTE  = _00_SCI_RTS;
  SCI0.SMR.BYTE   = _00_SCI_CLOCK_PCLK | _00_SCI_STOP_1 |
                    _00_SCI_PARITY_DISABLE | _00_SCI_DATA_LENGTH_8 |
                    _00_SCI_MULTI_PROCESSOR_DISABLE |
                    _00_SCI_ASYNCHRONOUS_OR_I2C_MODE;
  SCI0.SCMR.BYTE  = _00_SCI_SERIAL_MODE | _00_SCI_DATA_LSB_FIRST |
                    _10_SCI_DATA_LENGTH_8_OR_7 | _62_SCI_SCMR_DEFAULT;

  SCI0.SEMR.BYTE  = _80_SCI_FALLING_EDGE_START_BIT |
                    _20_SCI_NOISE_FILTER_ENABLE |  _10_SCI_8_BASE_CLOCK |
                    _40_SCI_BAUDRATE_DOUBLE |
                    _04_SCI_BIT_MODULATION_ENABLE;
  SCI0.SNFR.BYTE  = _00_SCI_ASYNC_DIV_1;

  /* Set SCI0 pin */

  sci0_init_port();
  rx_mpc_disable();
}

/****************************************************************************
 * Name: r_sci0_start
 *
 * Description:
 * Starts SCI0
 ****************************************************************************/

void r_sci0_start(void)
{
  IR(SCI0, TXI0)  = 0u;  /* Clear interrupt flag */
  IR(SCI0, RXI0)  = 0u;  /* Clear interrupt flag */
  IEN(SCI0, TXI0) = 1u;  /* Enable SCI interrupt */
  IEN(SCI0, RXI0) = 1u;  /* Enable SCI interrupt */
  ICU.GENBL0.BIT.EN0 = 1u;
  ICU.GENBL0.BIT.EN1 = 1u;
}

/****************************************************************************
 * Name: r_sci0_stop
 *
 * Description:
 * Stops SCI0
 ****************************************************************************/

void r_sci0_stop(void)
{
  SCI0.SCR.BIT.TE  = 0u;   /* Disable serial transmit */
  SCI0.SCR.BIT.RE  = 0u;   /* Disable serial receive */
  SCI0.SCR.BIT.TIE = 0u;   /* disable TXI interrupt */
  SCI0.SCR.BIT.RIE = 0u;   /* disable RXI and ERI interrupt */
  IEN(SCI0, TXI0)  = 0u;
  ICU.GENBL0.BIT.EN0 = 0u;
  IR(SCI0, TXI0)  = 0u;
  IEN(SCI0, RXI0) = 0u;
  ICU.GENBL0.BIT.EN1 = 0u;
  IR(SCI0, RXI0) = 0u;
}

/****************************************************************************
 * Name: r_sci0_serial_receive
 *
 * Description:
 * Receives SCI0
 ****************************************************************************/

MD_STATUS r_sci0_serial_receive(uint8_t * const rx_buf, uint16_t rx_num)
{
  if (1u > rx_num)
    {
      return MD_ARGERROR;
    }

