apache/nuttx/arch/renesas/src/rx65n/rx65n_sci.c
  g_sci0_rx_count  = 0u;
  g_sci0_rx_length = rx_num;
  gp_sci0_rx_address = rx_buf;
  SCI0.SCR.BIT.RIE  = 1u;
  SCI0.SCR.BIT.RE   = 1u;
  return OK;
}

/****************************************************************************
 * Name: r_sci0_serial_send
 *
 * Description:
 * Transmits SCI0 data
 ****************************************************************************/

MD_STATUS r_sci0_serial_send(uint8_t * const tx_buf, uint16_t tx_num)
{
  if (1u > tx_num)
    {
      return MD_ARGERROR;
    }

  gp_sci0_tx_address = tx_buf;
  g_sci0_tx_count    = tx_num;

  /* Set TXD0 pin */

  SCI0.SCR.BIT.TIE = 1u;
  SCI0.SCR.BIT.TE  = 1u;
  return OK;
}
#endif

/****************************************************************************
 * Name: r_sci1_create
 *
 * Description:
 * Initializes SCI1 data
 ****************************************************************************/

#ifdef CONFIG_RX65N_SCI1
void r_sci1_create(void)
{
  rx_mpc_enable();
  MSTP(SCI1)   = 0u;                    /* Cancel SCI1 module stop state */
  IPR(SCI1, RXI1) = 15;                  /* Set interrupt priority */
  IPR(SCI1, TXI1) = 15;                  /* Set interrupt priority */
  SCI1.SCR.BYTE   = 0u;                  /* Clear the control register */

  /* Set clock enable */

  SCI1.SCR.BYTE         = _00_SCI_INTERNAL_SCK_UNUSED;
  SCI1.SIMR1.BIT.IICM   = 0u;                   /* Clear SIMR1.IICM bit */
  SCI1.SPMR.BIT.CKPH    = 0u;                   /* Clear SPMR.CKPH bit */
  SCI1.SPMR.BIT.CKPOL   = 0u;                   /* Clear SPMR.CKPOL bit */

  /* Set control registers */

  SCI1.SPMR.BYTE    = _00_SCI_RTS;
  SCI1.SMR.BYTE     = _00_SCI_CLOCK_PCLK | _00_SCI_STOP_1 |
                      _00_SCI_PARITY_DISABLE | _00_SCI_DATA_LENGTH_8 |
                      _00_SCI_MULTI_PROCESSOR_DISABLE |
                      _00_SCI_ASYNCHRONOUS_OR_I2C_MODE;
  SCI1.SCMR.BYTE    = _00_SCI_SERIAL_MODE | _00_SCI_DATA_LSB_FIRST |
                      _10_SCI_DATA_LENGTH_8_OR_7 | _62_SCI_SCMR_DEFAULT;
  SCI1.SEMR.BYTE    = _80_SCI_FALLING_EDGE_START_BIT |
                      _20_SCI_NOISE_FILTER_ENABLE |
                      _10_SCI_8_BASE_CLOCK | _40_SCI_BAUDRATE_DOUBLE |
                      _04_SCI_BIT_MODULATION_ENABLE;
  SCI1.SNFR.BYTE    = _00_SCI_ASYNC_DIV_1;

  /* Set SCI1 pin */

  sci1_init_port();
  rx_mpc_disable();
}

/****************************************************************************
 * Name: r_sci1_start
 *
 * Description:
 * Starts SCI1
 ****************************************************************************/

void r_sci1_start(void)
{
  IR(SCI1, TXI1) = 0u;   /* Clear interrupt flag */
  IR(SCI1, RXI1) = 0u;   /* Clear interrupt flag */
  IEN(SCI1, TXI1) = 1u;  /* Enable SCI interrupt */
  IEN(SCI1, RXI1) = 1u;  /* Enable SCI interrupt */
  ICU.GENBL0.BIT.EN2 = 1u;
  ICU.GENBL0.BIT.EN3 = 1u;
}

/****************************************************************************
 * Name: r_sci1_stop
 *
 * Description:
 * Stops SCI1
 ****************************************************************************/

void r_sci1_stop(void)
{
  SCI1.SCR.BIT.TE  = 0u;        /* Disable serial transmit */
  SCI1.SCR.BIT.RE  = 0u;        /* Disable serial receive */
  SCI1.SCR.BIT.TIE = 0u;        /* disable TXI interrupt */
  SCI1.SCR.BIT.RIE = 0u;        /* disable RXI and ERI interrupt */
  IEN(SCI1, TXI1)  = 0u;
  ICU.GENBL0.BIT.EN2 = 0u;
  IR(SCI1, TXI1)  = 0u;
  IEN(SCI1, RXI1) = 0u;
  ICU.GENBL0.BIT.EN3 = 0u;
  IR(SCI1, RXI1) = 0u;
}

/****************************************************************************
 * Name: r_sci1_serial_receive
 *
 * Description:
 * Receives SCI1 data
 ****************************************************************************/

MD_STATUS r_sci1_serial_receive(uint8_t * const rx_buf, uint16_t rx_num)
{
  if (1u > rx_num)
    {
      return MD_ARGERROR;
    }

  g_sci1_rx_count  = 0u;
  g_sci1_rx_length = rx_num;
  gp_sci1_rx_address = rx_buf;
  SCI1.SCR.BIT.RIE  = 1u;
  SCI1.SCR.BIT.RE   = 1u;
  return OK;
}

/****************************************************************************
 * Name: r_sci1_serial_send
 *
 * Description:
 * Transmit SCI1 data
 ****************************************************************************/

MD_STATUS r_sci1_serial_send(uint8_t * const tx_buf, uint16_t tx_num)
{
  if (1u > tx_num)
    {
      return MD_ARGERROR;
    }

  gp_sci1_tx_address = tx_buf;
  g_sci1_tx_count    = tx_num;

  /* Set TXD1 pin */

  SCI1.SCR.BIT.TIE = 1u;
  SCI1.SCR.BIT.TE  = 1u;
  return OK;
}
#endif

/****************************************************************************
 * Name: r_sci2_create
 *
 * Description:
 * Initialize SCI2
 ****************************************************************************/

#ifdef CONFIG_RX65N_SCI2
void r_sci2_create(void)
{
  rx_mpc_enable();
  MSTP(SCI2)    = 0u;                   /* Cancel SCI2 module stop state */
  IPR(SCI2, RXI2) = 15;                  /* Set interrupt priority */
  IPR(SCI2, TXI2) = 15;                  /* Set interrupt priority */
  SCI2.SCR.BYTE  = 0u;                  /* Clear the control register */

  /* Set clock enable */

  SCI2.SCR.BYTE         = _00_SCI_INTERNAL_SCK_UNUSED;
  SCI2.SIMR1.BIT.IICM   = 0u;                   /* Clear SIMR1.IICM bit */
  SCI2.SPMR.BIT.CKPH    = 0u;                   /* Clear SPMR.CKPH bit */
  SCI2.SPMR.BIT.CKPOL   = 0u;                   /* Clear SPMR.CKPOL bit */

  /* Set control registers */

  SCI2.SPMR.BYTE   = _00_SCI_RTS;
  SCI2.SMR.BYTE    = _00_SCI_CLOCK_PCLK | _00_SCI_STOP_1 |
                     _00_SCI_PARITY_DISABLE | _00_SCI_DATA_LENGTH_8 |
                     _00_SCI_MULTI_PROCESSOR_DISABLE |
                     _00_SCI_ASYNCHRONOUS_OR_I2C_MODE;
  SCI2.SCMR.BYTE   = _00_SCI_SERIAL_MODE | _00_SCI_DATA_LSB_FIRST |
                     _10_SCI_DATA_LENGTH_8_OR_7 | _62_SCI_SCMR_DEFAULT;
  SCI2.SEMR.BYTE   = _80_SCI_FALLING_EDGE_START_BIT |
                     _20_SCI_NOISE_FILTER_ENABLE | _10_SCI_8_BASE_CLOCK |
                     _40_SCI_BAUDRATE_DOUBLE | _04_SCI_BIT_MODULATION_ENABLE;
  SCI2.SNFR.BYTE   = _00_SCI_ASYNC_DIV_1;

