apache/nuttx/arch/renesas/src/rx65n/rx65n_sci.c
  /* Set SCI2 pin */

  sci2_init_port();
  rx_mpc_disable();
}

/****************************************************************************
 * Name: r_sci2_start
 *
 * Description:
 * Start SCI2
 ****************************************************************************/

void r_sci2_start(void)
{
  IR(SCI2, TXI2) = 0u;   /* Clear interrupt flag */
  IR(SCI2, RXI2) = 0u;   /* Clear interrupt flag */
  IEN(SCI2, TXI2) = 1u;  /* Enable SCI interrupt */
  IEN(SCI2, RXI2) = 1u;  /* Enable SCI interrupt */
  ICU.GENBL0.BIT.EN4 = 1u;
  ICU.GENBL0.BIT.EN5 = 1u;
}

/****************************************************************************
 * Name: r_sci2_stop
 *
 * Description:
 * Stops SCI2
 ****************************************************************************/

void r_sci2_stop(void)
{
  SCI2.SCR.BIT.TE  = 0u;   /* Disable serial transmit */
  SCI2.SCR.BIT.RE  = 0u;   /* Disable serial receive */
  SCI2.SCR.BIT.TIE = 0u;   /* disable TXI interrupt */
  SCI2.SCR.BIT.RIE = 0u;   /* disable RXI and ERI interrupt */
  IEN(SCI2, TXI2)  = 0u;
  ICU.GENBL0.BIT.EN4 = 0u;
  IR(SCI2, TXI2)  = 0u;
  IEN(SCI2, RXI2) = 0u;
  ICU.GENBL0.BIT.EN5 = 0u;
  IR(SCI2, RXI2) = 0u;
}

/****************************************************************************
 * Name: r_sci2_serial_receive
 *
 * Description:
 * Receives SCI2 data
 ****************************************************************************/

MD_STATUS r_sci2_serial_receive(uint8_t * const rx_buf, uint16_t rx_num)
{
  if (1u > rx_num)
    {
      return MD_ARGERROR;
    }

  g_sci2_rx_count  = 0u;
  g_sci2_rx_length = rx_num;
  gp_sci2_rx_address = rx_buf;
  SCI2.SCR.BIT.RIE = 1u;
  SCI2.SCR.BIT.RE  = 1u;
  return OK;
}

/****************************************************************************
 * Name: r_sci2_serial_send
 *
 * Description:
 * Send SCI2 data
 ****************************************************************************/

MD_STATUS r_sci2_serial_send(uint8_t * const tx_buf, uint16_t tx_num)
{
  if (1u > tx_num)
    {
      return MD_ARGERROR;
    }

  gp_sci2_tx_address = tx_buf;
  g_sci2_tx_count    = tx_num;

  /* Set TXD2 pin */

  SCI2.SCR.BIT.TIE = 1u;
  SCI2.SCR.BIT.TE  = 1u;
  return OK;
}
#endif

/****************************************************************************
 * Name: r_sci3_create
 *
 * Description:
 * Initializes SCI3
 ****************************************************************************/

#ifdef CONFIG_RX65N_SCI3
void r_sci3_create(void)
{
  rx_mpc_enable();
  MSTP(SCI3)     = 0u;                  /* Cancel SCI3 module stop state */
  IPR(SCI3, RXI3) = 15;                  /* Set interrupt priority */
  IPR(SCI3, TXI3) = 15;                  /* Set interrupt priority */
  SCI3.SCR.BYTE  = 0u;                  /* Clear the control register */

  /* Set clock enable */

  SCI3.SCR.BYTE         = _00_SCI_INTERNAL_SCK_UNUSED;
  SCI3.SIMR1.BIT.IICM   = 0u;                   /* Clear SIMR1.IICM bit */
  SCI3.SPMR.BIT.CKPH    = 0u;                   /* Clear SPMR.CKPH bit */
  SCI3.SPMR.BIT.CKPOL   = 0u;                   /* Clear SPMR.CKPOL bit */

  /* Set control registers */

  SCI3.SPMR.BYTE  = _00_SCI_RTS;
  SCI3.SMR.BYTE   = _00_SCI_CLOCK_PCLK | _00_SCI_STOP_1 |
                    _00_SCI_PARITY_DISABLE | _00_SCI_DATA_LENGTH_8 |
                    _00_SCI_MULTI_PROCESSOR_DISABLE |
                    _00_SCI_ASYNCHRONOUS_OR_I2C_MODE;
  SCI3.SCMR.BYTE  = _00_SCI_SERIAL_MODE | _00_SCI_DATA_LSB_FIRST |
                    _10_SCI_DATA_LENGTH_8_OR_7 | _62_SCI_SCMR_DEFAULT;
  SCI3.SEMR.BYTE  = _80_SCI_FALLING_EDGE_START_BIT |
                    _20_SCI_NOISE_FILTER_ENABLE |
                    _10_SCI_8_BASE_CLOCK | _40_SCI_BAUDRATE_DOUBLE |
                    _04_SCI_BIT_MODULATION_ENABLE;
  SCI3.SNFR.BYTE  = _00_SCI_ASYNC_DIV_1;

  /* Set SCI3 pin */

  sci3_init_port();
  rx_mpc_disable();
}

/****************************************************************************
 * Name: r_sci3_create
 *
 * Description:
 * Initializes SCI3
 ****************************************************************************/

void r_sci3_start(void)
{
  IR(SCI3, TXI3)  = 0u;  /* Clear interrupt flag */
  IR(SCI3, RXI3)  = 0u;  /* Clear interrupt flag */
  IEN(SCI3, TXI3) = 1u;  /* Enable SCI interrupt */
  IEN(SCI3, RXI3) = 1u;  /* Enable SCI interrupt */
  ICU.GENBL0.BIT.EN6 = 0u;
  ICU.GENBL0.BIT.EN7 = 1u;
}

/****************************************************************************
 * Name: r_sci3_stop
 *
 * Description:
 * Stops SCI3
 ****************************************************************************/

void r_sci3_stop(void)
{
  SCI3.SCR.BIT.TE  = 0u; /* Disable serial transmit */
  SCI3.SCR.BIT.RE  = 0u; /* Disable serial receive */
  SCI3.SCR.BIT.TIE = 0u;   /* disable TXI interrupt */
  SCI3.SCR.BIT.RIE = 0u;   /* disable RXI and ERI interrupt */
  IEN(SCI3, TXI3)  = 0u;
  ICU.GENBL0.BIT.EN6 = 0u;
  IR(SCI3, TXI3)  = 0u;
  IEN(SCI3, RXI3) = 0u;
  ICU.GENBL0.BIT.EN7 = 0u;
  IR(SCI3, RXI3) = 0u;
}

/****************************************************************************
 * Name: r_sci3_serial_receive
 *
 * Description:
 * Receives SCI3 data
 ****************************************************************************/

MD_STATUS r_sci3_serial_receive(uint8_t * const rx_buf, uint16_t rx_num)
{
  if (1u > rx_num)
    {
      return MD_ARGERROR;
    }

  g_sci3_rx_count = 0u;
  g_sci3_rx_length = rx_num;
  gp_sci3_rx_address = rx_buf;
  SCI3.SCR.BIT.RIE = 1u;
  SCI3.SCR.BIT.RE  = 1u;
  return OK;
}

/****************************************************************************
 * Name: r_sci3_serial_send
 *
 * Description:
 * Send SCI3 data
 ****************************************************************************/

MD_STATUS r_sci3_serial_send(uint8_t * const tx_buf, uint16_t tx_num)
{
  if (1u > tx_num)
    {
      return MD_ARGERROR;
    }

  gp_sci3_tx_address = tx_buf;
  g_sci3_tx_count = tx_num;

  /* Set TXD3 pin */

  SCI3.SCR.BIT.TIE = 1u;
  SCI3.SCR.BIT.TE  = 1u;
  return OK;
}
#endif

/****************************************************************************
 * Name: r_sci4_create
 *
 * Description:
 * Initialize SCI4 data
 ****************************************************************************/

