apache/nuttx/arch/renesas/src/rx65n/rx65n_sci.c
#ifdef CONFIG_RX65N_SCI4
void r_sci4_create(void)
{
  rx_mpc_enable();
  MSTP(SCI4) = 0u;                      /* Cancel SCI4 module stop state */
  IPR(SCI4, RXI4) = 15;          /* Set interrupt priority */
  IPR(SCI4, TXI4) = 15;          /* Set interrupt priority */
  SCI4.SCR.BYTE  = 0u;          /* Clear the control register */

  /* Set clock enable */

  SCI4.SCR.BYTE = _00_SCI_INTERNAL_SCK_UNUSED;
  SCI4.SIMR1.BIT.IICM = 0u;                     /* Clear SIMR1.IICM bit */
  SCI4.SPMR.BIT.CKPH  = 0u;                     /* Clear SPMR.CKPH bit */
  SCI4.SPMR.BIT.CKPOL = 0u;                     /* Clear SPMR.CKPOL bit */

  /* Set control registers */

  SCI4.SPMR.BYTE = _00_SCI_RTS;
  SCI4.SMR.BYTE  = _00_SCI_CLOCK_PCLK | _00_SCI_STOP_1 |
                   _00_SCI_PARITY_DISABLE | _00_SCI_DATA_LENGTH_8 |
                   _00_SCI_MULTI_PROCESSOR_DISABLE |
                   _00_SCI_ASYNCHRONOUS_OR_I2C_MODE;
  SCI4.SCMR.BYTE = _00_SCI_SERIAL_MODE | _00_SCI_DATA_LSB_FIRST |
                   _10_SCI_DATA_LENGTH_8_OR_7 |
                   _62_SCI_SCMR_DEFAULT;
  SCI4.SEMR.BYTE = _80_SCI_FALLING_EDGE_START_BIT |
                   _20_SCI_NOISE_FILTER_ENABLE |
                   _10_SCI_8_BASE_CLOCK | _40_SCI_BAUDRATE_DOUBLE |
                   _04_SCI_BIT_MODULATION_ENABLE;
  SCI4.SNFR.BYTE = _00_SCI_ASYNC_DIV_1;

  /* Set SCI4 pin */

  sci4_init_port();
  rx_mpc_disable();
}

/****************************************************************************
 * Name: r_sci4_start
 *
 * Description:
 * Start SCI4
 ****************************************************************************/

void r_sci4_start(void)
{
  rx_mpc_enable();
  IR(SCI4, TXI4) = 0u;   /* Clear interrupt flag */
  IR(SCI4, RXI4) = 0u;   /* Clear interrupt flag */
  IEN(SCI4, TXI4) = 1u;  /* Enable SCI interrupt */
  IEN(SCI4, RXI4) = 1u;  /* Enable SCI interrupt */
  ICU.GENBL0.BIT.EN8 = 0u;
  ICU.GENBL0.BIT.EN9 = 1u;
}

/****************************************************************************
 * Name: r_sci4_stop
 *
 * Description:
 * Stop SCI4
 ****************************************************************************/

void r_sci4_stop(void)
{
  SCI4.SCR.BIT.TE  = 0u;        /* Disable serial transmit */
  SCI4.SCR.BIT.RE  = 0u;        /* Disable serial receive */
  SCI4.SCR.BIT.TIE = 0u;        /* disable TXI interrupt */
  SCI4.SCR.BIT.RIE = 0u;        /* disable RXI and ERI interrupt */
  IEN(SCI4, TXI4)  = 0u;
  ICU.GENBL0.BIT.EN8 = 0u;
  IR(SCI4, TXI4)  = 0u;
  IEN(SCI4, RXI4) = 0u;
  ICU.GENBL0.BIT.EN9 = 0u;
  IR(SCI4, RXI4) = 0u;
}

/****************************************************************************
 * Name: r_sci4_serial_receive
 *
 * Description:
 * Receive SCI4 data
 ****************************************************************************/

MD_STATUS r_sci4_serial_receive(uint8_t * const rx_buf, uint16_t rx_num)
{
  if (1u > rx_num)
    {
      return MD_ARGERROR;
    }

  g_sci4_rx_count  = 0u;
  g_sci4_rx_length = rx_num;
  gp_sci4_rx_address = rx_buf;
  SCI4.SCR.BIT.RIE = 1u;
  SCI4.SCR.BIT.RE  = 1u;
  return OK;
}

/****************************************************************************
 * Name: r_sci4_serial_send
 *
 * Description:
 * Send SCI4 data
 ****************************************************************************/

MD_STATUS r_sci4_serial_send(uint8_t * const tx_buf, uint16_t tx_num)
{
  if (1u > tx_num)
    {
      return MD_ARGERROR;
    }

  gp_sci4_tx_address = tx_buf;
  g_sci4_tx_count    = tx_num;

  /* Set TXD4 pin */

  SCI4.SCR.BIT.TIE = 1u;
  SCI4.SCR.BIT.TE  = 1u;
  return OK;
}
#endif

/****************************************************************************
 * Name: r_sci5_create
 *
 * Description:
 * SCI5 Initialization
 ****************************************************************************/

#ifdef CONFIG_RX65N_SCI5
void r_sci5_create(void)
{
  rx_mpc_enable();
  MSTP(SCI5)     = 0u;                  /* Cancel SCI0 module stop state */
  IPR(SCI5, RXI5) = 15;                  /* Set interrupt priority */
  IPR(SCI5, TXI5) = 15;                  /* Set interrupt priority */
  SCI5.SCR.BYTE  = 0u;                  /* Clear the control register */

  /* Set clock enable */

  SCI5.SCR.BYTE         = _00_SCI_INTERNAL_SCK_UNUSED;
  SCI5.SIMR1.BIT.IICM   = 0u;                   /* Clear SIMR1.IICM bit */
  SCI5.SPMR.BIT.CKPH    = 0u;                   /* Clear SPMR.CKPH bit */
  SCI5.SPMR.BIT.CKPOL   = 0u;                   /* Clear SPMR.CKPOL bit */

  /* Set control registers */

  SCI5.SPMR.BYTE = _00_SCI_RTS;
  SCI5.SMR.BYTE  = _00_SCI_CLOCK_PCLK | _00_SCI_STOP_1 |
                   _00_SCI_PARITY_DISABLE | _00_SCI_DATA_LENGTH_8 |
                   _00_SCI_MULTI_PROCESSOR_DISABLE |
                   _00_SCI_ASYNCHRONOUS_OR_I2C_MODE;
  SCI5.SCMR.BYTE = _00_SCI_SERIAL_MODE | _00_SCI_DATA_LSB_FIRST |
                   _10_SCI_DATA_LENGTH_8_OR_7 | _62_SCI_SCMR_DEFAULT;
  SCI5.SEMR.BYTE = _80_SCI_FALLING_EDGE_START_BIT |
                   _20_SCI_NOISE_FILTER_ENABLE | _10_SCI_8_BASE_CLOCK |
                                   _40_SCI_BAUDRATE_DOUBLE |
                   _04_SCI_BIT_MODULATION_ENABLE;
  SCI5.SNFR.BYTE = _00_SCI_ASYNC_DIV_1;

  /* Set SCI5 pin */

  sci5_init_port();
  rx_mpc_disable();
}

/****************************************************************************
 * Name: r_sci5_start
 *
 * Description:
 * Start SCI5
 ****************************************************************************/

void r_sci5_start(void)
{
  IR(SCI5, TXI5) = 0u;   /* Clear interrupt flag */
  IR(SCI5, RXI5) = 0u;   /* Clear interrupt flag */
  IEN(SCI5, TXI5) = 1u;  /* Enable SCI interrupt */
  IEN(SCI5, RXI5) = 1u;  /* Enable SCI interrupt */
  ICU.GENBL0.BIT.EN10 = 0u;
  ICU.GENBL0.BIT.EN11 = 1u;
}

/****************************************************************************
 * Name: r_sci5_stop
 *
 * Description:
 * Stop SCI5
 ****************************************************************************/

void r_sci5_stop(void)
{
  SCI5.SCR.BIT.TE  = 0u;     /* Disable serial transmit */
  SCI5.SCR.BIT.RE  = 0u;     /* Disable serial receive */
  SCI5.SCR.BIT.TIE = 0u;        /* disable TXI interrupt */
  SCI5.SCR.BIT.RIE = 0u;        /* disable RXI and ERI interrupt */
  IEN(SCI5, TXI5)  = 0u;
  ICU.GENBL0.BIT.EN10 = 0u;
  IR(SCI5, TXI5) = 0u;
  IEN(SCI5, RXI5) = 0u;
  ICU.GENBL0.BIT.EN11 = 0u;
  IR(SCI5, RXI5) = 0u;
}

/****************************************************************************
 * Name: r_sci5_serial_receive
 *
 * Description:
 * Receive SCI5
 ****************************************************************************/

MD_STATUS r_sci5_serial_receive(uint8_t * const rx_buf, uint16_t rx_num)
{
  if (1u > rx_num)
    {
      return MD_ARGERROR;
    }

  g_sci5_rx_count = 0u;
  g_sci5_rx_length = rx_num;
  gp_sci5_rx_address = rx_buf;
  SCI5.SCR.BIT.RIE = 1u;
  SCI5.SCR.BIT.RE  = 1u;
  return OK;
}
/****************************************************************************
 * Name: r_sci5_serial_send
 *
 * Description:
 * Transmit SCI5 data
 ****************************************************************************/

MD_STATUS r_sci5_serial_send(uint8_t * const tx_buf, uint16_t tx_num)
{
  if (1u > tx_num)
    {
      return MD_ARGERROR;
    }

  gp_sci5_tx_address = tx_buf;
  g_sci5_tx_count    = tx_num;

  /* Set TXD5 pin */

  SCI5.SCR.BIT.TIE      = 1u;
  SCI5.SCR.BIT.TE       = 1u;
  return OK;
}
#endif

/****************************************************************************
 * Name: r_sci6_create
 *
 * Description:
 * Initialization of SCI6
 ****************************************************************************/

