apache/nuttx/arch/renesas/src/rx65n/rx65n_sci.c
#ifdef CONFIG_RX65N_SCI6
void r_sci6_create(void)
{
  rx_mpc_enable();
  MSTP(SCI6)      = 0u;                  /* Cancel SCI0 module stop state */
  IPR(SCI6, RXI6) = 15;                  /* Set interrupt priority */
  IPR(SCI6, TXI6) = 15;                  /* Set interrupt priority */
  SCI6.SCR.BYTE   = 0u;                  /* Clear the control register */

  /* Set clock enable */

  SCI6.SCR.BYTE   = _00_SCI_INTERNAL_SCK_UNUSED;
  SCI6.SIMR1.BIT.IICM   = 0u;                   /* Clear SIMR1.IICM bit */
  SCI6.SPMR.BIT.CKPH    = 0u;                   /* Clear SPMR.CKPH bit */
  SCI6.SPMR.BIT.CKPOL   = 0u;                   /* Clear SPMR.CKPOL bit */

  /* Set control registers */

  SCI6.SPMR.BYTE = _00_SCI_RTS;
  SCI6.SMR.BYTE  = _00_SCI_CLOCK_PCLK | _00_SCI_STOP_1 |
                   _00_SCI_PARITY_DISABLE | _00_SCI_DATA_LENGTH_8 |
                   _00_SCI_MULTI_PROCESSOR_DISABLE |
                   _00_SCI_ASYNCHRONOUS_OR_I2C_MODE;
  SCI6.SCMR.BYTE = _00_SCI_SERIAL_MODE | _00_SCI_DATA_LSB_FIRST |
                   _10_SCI_DATA_LENGTH_8_OR_7 | _62_SCI_SCMR_DEFAULT;
  SCI6.SEMR.BYTE = _80_SCI_FALLING_EDGE_START_BIT |
                   _20_SCI_NOISE_FILTER_ENABLE |
                   _10_SCI_8_BASE_CLOCK | _40_SCI_BAUDRATE_DOUBLE |
                   _04_SCI_BIT_MODULATION_ENABLE;
  SCI6.SNFR.BYTE = _00_SCI_ASYNC_DIV_1;

  /* Set SCI6 pin */

  sci6_init_port();
  rx_mpc_disable();
}

/****************************************************************************
 * Name: r_sci6_start
 *
 * Description:
 * Start SCI6
 ****************************************************************************/

void r_sci6_start(void)
{
  IR(SCI6, TXI6) = 0u;   /* Clear interrupt flag */
  IR(SCI6, RXI6) = 0u;   /* Clear interrupt flag */
  IEN(SCI6, TXI6) = 1u;  /* Enable SCI interrupt */
  IEN(SCI6, RXI6) = 1u;  /* Enable SCI interrupt */
  ICU.GENBL0.BIT.EN12 = 0u;
  ICU.GENBL0.BIT.EN13 = 1u;
}

/****************************************************************************
 * Name: r_sci6_stop
 *
 * Description:
 * Stop SCI6
 ****************************************************************************/

void r_sci6_stop(void)
{
  SCI6.SCR.BIT.TE = 0u;     /* Disable serial transmit */
  SCI6.SCR.BIT.RE = 0u;     /* Disable serial receive */
  SCI6.SCR.BIT.TIE = 0u;        /* disable TXI interrupt */
  SCI6.SCR.BIT.RIE = 0u;        /* disable RXI and ERI interrupt */
  IEN(SCI6, TXI6)  = 0u;
  ICU.GENBL0.BIT.EN12 = 0u;
  IR(SCI6, TXI6) = 0u;
  IEN(SCI6, RXI6) = 0u;
  ICU.GENBL0.BIT.EN13 = 0u;
  IR(SCI6, RXI6) = 0u;
}

/****************************************************************************
 * Name: r_sci6_serial_receive
 *
 * Description:
 * Stop SCI6
 ****************************************************************************/

MD_STATUS r_sci6_serial_receive(uint8_t * const rx_buf, uint16_t rx_num)
{
  if (1u > rx_num)
    {
      return MD_ARGERROR;
    }

  g_sci6_rx_count = 0u;
  g_sci6_rx_length = rx_num;
  gp_sci6_rx_address = rx_buf;
  SCI6.SCR.BIT.RIE = 1u;
  SCI6.SCR.BIT.RE  = 1u;
  return OK;
}

/****************************************************************************
 * Name: r_sci6_serial_send
 *
 * Description:
 * Stop SCI6
 ****************************************************************************/

MD_STATUS r_sci6_serial_send(uint8_t * const tx_buf, uint16_t tx_num)
{
  if (1u > tx_num)
    {
      return MD_ARGERROR;
    }

  gp_sci6_tx_address = tx_buf;
  g_sci6_tx_count    = tx_num;

  /* Set TXD0 pin */

  SCI6.SCR.BIT.TIE = 1u;
  SCI6.SCR.BIT.TE  = 1u;
  return OK;
}
#endif

/****************************************************************************
 * Name: r_sci7_create
 *
 * Description:
 * SCI7
 ****************************************************************************/

#ifdef CONFIG_RX65N_SCI7
void r_sci7_create(void)
{
  rx_mpc_enable();
  MSTP(SCI7)      = 0u;                   /* Cancel SCI7 module stop state */
  IPR(SCI7, RXI7) = 15;                  /* Set interrupt priority */
  IPR(SCI7, TXI7) = 15;                  /* Set interrupt priority */
  SCI7.SCR.BYTE  = 0u;                  /* Clear the control register */

  /* Set clock enable */

  SCI7.SCR.BYTE         = _00_SCI_INTERNAL_SCK_UNUSED;
  SCI7.SIMR1.BIT.IICM   = 0u;   /* Clear SIMR1.IICM bit */
  SCI7.SPMR.BIT.CKPH    = 0u;   /* Clear SPMR.CKPH bit */
  SCI7.SPMR.BIT.CKPOL   = 0u;   /* Clear SPMR.CKPOL bit */

  /* Set control registers */

  SCI7.SPMR.BYTE = _00_SCI_RTS;
  SCI7.SMR.BYTE  = _00_SCI_CLOCK_PCLK | _00_SCI_STOP_1 |
                   _00_SCI_PARITY_DISABLE | _00_SCI_DATA_LENGTH_8 |
                   _00_SCI_MULTI_PROCESSOR_DISABLE |
                   _00_SCI_ASYNCHRONOUS_OR_I2C_MODE;
  SCI7.SCMR.BYTE = _00_SCI_SERIAL_MODE | _00_SCI_DATA_LSB_FIRST |
                   _10_SCI_DATA_LENGTH_8_OR_7 | _62_SCI_SCMR_DEFAULT;

  SCI7.SEMR.BYTE = _80_SCI_FALLING_EDGE_START_BIT |
                   _20_SCI_NOISE_FILTER_ENABLE |
                   _10_SCI_8_BASE_CLOCK | _40_SCI_BAUDRATE_DOUBLE |
                   _04_SCI_BIT_MODULATION_ENABLE;
  SCI7.SNFR.BYTE  = _00_SCI_ASYNC_DIV_1;

  /* Set SCI7 pin */

  sci7_init_port();
  rx_mpc_disable();
}

/****************************************************************************
 * Name: r_sci7_start
 *
 * Description:
 * SCI7 Start
 ****************************************************************************/

void r_sci7_start(void)
{
  IR(SCI7, TXI7) = 0u;   /* Clear interrupt flag */
  IR(SCI7, RXI7) = 0u;   /* Clear interrupt flag */
  IEN(SCI7, TXI7) = 1u;  /* Enable SCI interrupt */
  IEN(SCI7, RXI7) = 1u;  /* Enable SCI interrupt */
  ICU.GENBL0.BIT.EN14 = 0u;
  ICU.GENBL0.BIT.EN15 = 1u;
}

/****************************************************************************
 * Name: r_sci7_stop
 *
 * Description:
 * SCI7 Stop
 ****************************************************************************/

void r_sci7_stop(void)
{
  SCI7.SCR.BIT.TE = 0u;    /* Disable serial transmit */
  SCI7.SCR.BIT.RE = 0u;    /* Disable serial receive */
  SCI7.SCR.BIT.TIE = 0u;   /* disable TXI interrupt */
  SCI7.SCR.BIT.RIE = 0u;        /* disable RXI and ERI interrupt */
  IEN(SCI7, TXI7) = 0u;
  IR(SCI7, TXI7)  = 0u;
  IEN(SCI7, RXI7) = 0u;
  IR(SCI7, RXI7)  = 0u;
  ICU.GENBL0.BIT.EN14 = 0u;
  ICU.GENBL0.BIT.EN15 = 0u;
}

/****************************************************************************
 * Name: r_sci7_serial_receive
 *
 * Description:
 * Receive SCI7 data
 ****************************************************************************/

MD_STATUS r_sci7_serial_receive(uint8_t * const rx_buf, uint16_t rx_num)
{
  if (1u > rx_num)
    {
      return MD_ARGERROR;
    }

  g_sci7_rx_count   = 0u;
  g_sci7_rx_length  = rx_num;
  gp_sci7_rx_address = rx_buf;
  SCI7.SCR.BIT.RIE   = 1u;
  SCI7.SCR.BIT.RE    = 1u;
  return OK;
}

/****************************************************************************
 * Name: r_sci7_serial_send
 *
 * Description:
 * Send SCI7 data
 ****************************************************************************/

MD_STATUS r_sci7_serial_send(uint8_t * const tx_buf, uint16_t tx_num)
{
  if (1u > tx_num)
    {
      return MD_ARGERROR;
    }

  gp_sci7_tx_address = tx_buf;
  g_sci7_tx_count    = tx_num;

  /* Set TXD0 pin */

  SCI7.SCR.BIT.TIE = 1u;
  SCI7.SCR.BIT.TE  = 1u;
  return OK;
}
#endif

/****************************************************************************
 * Name: r_sci8_create
 *
 * Description:
 * SCI8
 ****************************************************************************/

#ifdef CONFIG_RX65N_SCI8
void r_sci8_create(void)
{
  rx_mpc_enable();
  MSTP(SCI8)      = 0u;                   /* Cancel SCI8 module stop state */
  IPR(SCI8, RXI8) = 15;                  /* Set interrupt priority */
  IPR(SCI8, TXI8) = 15;                  /* Set interrupt priority */
  SCI8.SCR.BYTE  = 0u;                  /* Clear the control register */

  /* Set clock enable */

