apache/nuttx/arch/renesas/src/rx65n/rx65n_sci.c
  SCI8.SCR.BYTE         = _00_SCI_INTERNAL_SCK_UNUSED;
  SCI8.SIMR1.BIT.IICM   = 0u;   /* Clear SIMR1.IICM bit */
  SCI8.SPMR.BIT.CKPH    = 0u;   /* Clear SPMR.CKPH bit */
  SCI8.SPMR.BIT.CKPOL   = 0u;   /* Clear SPMR.CKPOL bit */

  /* Set control registers */

  SCI8.SPMR.BYTE = _00_SCI_RTS;
  SCI8.SMR.BYTE  = _00_SCI_CLOCK_PCLK | _00_SCI_STOP_1 |
                   _00_SCI_PARITY_DISABLE | _00_SCI_DATA_LENGTH_8 |
                   _00_SCI_MULTI_PROCESSOR_DISABLE |
                   _00_SCI_ASYNCHRONOUS_OR_I2C_MODE;
  SCI8.SCMR.BYTE = _00_SCI_SERIAL_MODE | _00_SCI_DATA_LSB_FIRST |
                   _10_SCI_DATA_LENGTH_8_OR_7 | _62_SCI_SCMR_DEFAULT;

  SCI8.SEMR.BYTE = _80_SCI_FALLING_EDGE_START_BIT |
                   _20_SCI_NOISE_FILTER_ENABLE |
                   _10_SCI_8_BASE_CLOCK | _40_SCI_BAUDRATE_DOUBLE |
                   _04_SCI_BIT_MODULATION_ENABLE;
  SCI8.SNFR.BYTE  = _00_SCI_ASYNC_DIV_1;

  /* Set SCI8 pin */

  sci8_init_port();
  rx_mpc_disable();
}

/****************************************************************************
 * Name: r_sci8_start
 *
 * Description:
 * SCI8 Start
 ****************************************************************************/

void r_sci8_start(void)
{
  IR(SCI8, TXI8) = 0u;   /* Clear interrupt flag */
  IR(SCI8, RXI8) = 0u;   /* Clear interrupt flag */
  IEN(SCI8, TXI8) = 1u;  /* Enable SCI interrupt */
  IEN(SCI8, RXI8) = 1u;  /* Enable SCI interrupt */
  ICU.GENBL1.BIT.EN24 = 0u;
  ICU.GENBL1.BIT.EN25 = 1u;
}

/****************************************************************************
 * Name: r_sci8_stop
 *
 * Description:
 * SCI8 Stop
 ****************************************************************************/

void r_sci8_stop(void)
{
  SCI8.SCR.BIT.TE = 0u;    /* Disable serial transmit */
  SCI8.SCR.BIT.RE = 0u;    /* Disable serial receive */
  SCI8.SCR.BIT.TIE = 0u;   /* disable TXI interrupt */
  SCI8.SCR.BIT.RIE = 0u;        /* disable RXI and ERI interrupt */
  IEN(SCI8, TXI8) = 0u;
  IR(SCI8, TXI8)  = 0u;
  IEN(SCI8, RXI8) = 0u;
  IR(SCI8, RXI8)  = 0u;
  ICU.GENBL1.BIT.EN24 = 0u;
  ICU.GENBL1.BIT.EN25 = 0u;
}

/****************************************************************************
 * Name: r_sci8_serial_receive
 *
 * Description:
 * Receive SCI8 data
 ****************************************************************************/

MD_STATUS r_sci8_serial_receive(uint8_t * const rx_buf, uint16_t rx_num)
{
  if (1u > rx_num)
    {
      return MD_ARGERROR;
    }

  g_sci8_rx_count   = 0u;
  g_sci8_rx_length  = rx_num;
  gp_sci8_rx_address = rx_buf;
  SCI8.SCR.BIT.RIE   = 1u;
  SCI8.SCR.BIT.RE    = 1u;
  return OK;
}

/****************************************************************************
 * Name: r_sci8_serial_send
 *
 * Description:
 * Send SCI8 data
 ****************************************************************************/

MD_STATUS r_sci8_serial_send(uint8_t * const tx_buf, uint16_t tx_num)
{
  if (1u > tx_num)
    {
      return MD_ARGERROR;
    }

  gp_sci8_tx_address = tx_buf;
  g_sci8_tx_count    = tx_num;

  /* Set TXD0 pin */

  SCI8.SCR.BIT.TIE = 1u;
  SCI8.SCR.BIT.TE  = 1u;
  return OK;
}
#endif

/****************************************************************************
 * Name: r_sci9_create
 *
 * Description:
 * SCI9
 ****************************************************************************/

#ifdef CONFIG_RX65N_SCI9
void r_sci9_create(void)
{
  rx_mpc_enable();
  MSTP(SCI9)      = 0u;                   /* Cancel SCI9 module stop state */
  IPR(SCI9, RXI9) = 15;                  /* Set interrupt priority */
  IPR(SCI9, TXI9) = 15;                  /* Set interrupt priority */
  SCI9.SCR.BYTE  = 0u;                  /* Clear the control register */

  /* Set clock enable */

  SCI9.SCR.BYTE         = _00_SCI_INTERNAL_SCK_UNUSED;
  SCI9.SIMR1.BIT.IICM   = 0u;   /* Clear SIMR1.IICM bit */
  SCI9.SPMR.BIT.CKPH    = 0u;   /* Clear SPMR.CKPH bit */
  SCI9.SPMR.BIT.CKPOL   = 0u;   /* Clear SPMR.CKPOL bit */

  /* Set control registers */

  SCI9.SPMR.BYTE = _00_SCI_RTS;
  SCI9.SMR.BYTE  = _00_SCI_CLOCK_PCLK | _00_SCI_STOP_1 |
                   _00_SCI_PARITY_DISABLE | _00_SCI_DATA_LENGTH_8 |
                   _00_SCI_MULTI_PROCESSOR_DISABLE |
                   _00_SCI_ASYNCHRONOUS_OR_I2C_MODE;
  SCI9.SCMR.BYTE = _00_SCI_SERIAL_MODE | _00_SCI_DATA_LSB_FIRST |
                   _10_SCI_DATA_LENGTH_8_OR_7 | _62_SCI_SCMR_DEFAULT;

  SCI9.SEMR.BYTE = _80_SCI_FALLING_EDGE_START_BIT |
                   _20_SCI_NOISE_FILTER_ENABLE |
                   _10_SCI_8_BASE_CLOCK | _40_SCI_BAUDRATE_DOUBLE |
                   _04_SCI_BIT_MODULATION_ENABLE;
  SCI9.SNFR.BYTE  = _00_SCI_ASYNC_DIV_1;

  /* Set SCI9 pin */

  sci9_init_port();
  rx_mpc_disable();
}

/****************************************************************************
 * Name: r_sci9_start
 *
 * Description:
 * SCI9 Start
 ****************************************************************************/

void r_sci9_start(void)
{
  IR(SCI9, TXI9) = 0u;   /* Clear interrupt flag */
  IR(SCI9, RXI9) = 0u;   /* Clear interrupt flag */
  IEN(SCI9, TXI9) = 1u;  /* Enable SCI interrupt */
  IEN(SCI9, RXI9) = 1u;  /* Enable SCI interrupt */
  ICU.GENBL1.BIT.EN26 = 0u;
  ICU.GENBL1.BIT.EN27 = 1u;
}

/****************************************************************************
 * Name: r_sci9_stop
 *
 * Description:
 * SCI9 Stop
 ****************************************************************************/

void r_sci9_stop(void)
{
  SCI9.SCR.BIT.TE = 0u;    /* Disable serial transmit */
  SCI9.SCR.BIT.RE = 0u;    /* Disable serial receive */
  SCI9.SCR.BIT.TIE = 0u;   /* disable TXI interrupt */
  SCI9.SCR.BIT.RIE = 0u;        /* disable RXI and ERI interrupt */
  IEN(SCI9, TXI9) = 0u;
  IR(SCI9, TXI9)  = 0u;
  IEN(SCI9, RXI9) = 0u;
  IR(SCI9, RXI9)  = 0u;
  ICU.GENBL1.BIT.EN26 = 0u;
  ICU.GENBL1.BIT.EN27 = 0u;
}

/****************************************************************************
 * Name: r_sci9_serial_receive
 *
 * Description:
 * Receive SCI9 data
 ****************************************************************************/

MD_STATUS r_sci9_serial_receive(uint8_t * const rx_buf, uint16_t rx_num)
{
  if (1u > rx_num)
    {
      return MD_ARGERROR;
    }

  g_sci9_rx_count   = 0u;
  g_sci9_rx_length  = rx_num;
  gp_sci9_rx_address = rx_buf;
  SCI9.SCR.BIT.RIE   = 1u;
  SCI9.SCR.BIT.RE    = 1u;
  return OK;
}

/****************************************************************************
 * Name: r_sci9_serial_send
 *
 * Description:
 * Send SCI9 data
 ****************************************************************************/

MD_STATUS r_sci9_serial_send(uint8_t * const tx_buf, uint16_t tx_num)
{
  if (1u > tx_num)
    {
      return MD_ARGERROR;
    }

  gp_sci9_tx_address = tx_buf;
  g_sci9_tx_count    = tx_num;

  /* Set TXD0 pin */

  SCI9.SCR.BIT.TIE = 1u;
  SCI9.SCR.BIT.TE  = 1u;
  return OK;
}
#endif

/****************************************************************************
 * Name: r_sci10_create
 *
 * Description:
 * SCI10 Initialization
 ****************************************************************************/

#ifdef CONFIG_RX65N_SCI10
void r_sci10_create(void)
{
  rx_mpc_enable();
  MSTP(SCI10)      = 0u;                  /* Cancel SCI10 module stop state */
  IPR(SCI10, RXI10) = 15;                  /* Set interrupt priority */
  IPR(SCI10, TXI10) = 15;                  /* Set interrupt priority */
  SCI10.SCR.BYTE   = 0u;                  /* Clear the control register */

  /* Set clock enable */

  SCI10.SCR.BYTE  = _00_SCI_INTERNAL_SCK_UNUSED;
  SCI10.SIMR1.BIT.IICM   = 0u;                   /* Clear SIMR1.IICM bit */
  SCI10.SPMR.BIT.CKPH    = 0u;                   /* Clear SPMR.CKPH bit */
  SCI10.SPMR.BIT.CKPOL   = 0u;                   /* Clear SPMR.CKPOL bit */

  /* Set control registers */

  SCI10.SPMR.BYTE  = _00_SCI_RTS;
  SCI10.SMR.BYTE   = _00_SCI_CLOCK_PCLK | _00_SCI_STOP_1 |
                    _00_SCI_PARITY_DISABLE | _00_SCI_DATA_LENGTH_8 |
                    _00_SCI_MULTI_PROCESSOR_DISABLE |
                    _00_SCI_ASYNCHRONOUS_OR_I2C_MODE;
  SCI10.SCMR.BYTE  = _00_SCI_SERIAL_MODE | _00_SCI_DATA_LSB_FIRST |
                    _10_SCI_DATA_LENGTH_8_OR_7 | _62_SCI_SCMR_DEFAULT;

