apache/nuttx/arch/renesas/src/rx65n/rx65n_sci.c
  SCI10.SEMR.BYTE  = _80_SCI_FALLING_EDGE_START_BIT |
                    _20_SCI_NOISE_FILTER_ENABLE |  _10_SCI_8_BASE_CLOCK |
                    _40_SCI_BAUDRATE_DOUBLE |
                    _04_SCI_BIT_MODULATION_ENABLE;
  SCI10.SNFR.BYTE  = _00_SCI_ASYNC_DIV_1;

  /* Set SCI10 pin */

  sci10_init_port();
  rx_mpc_disable();
}

/****************************************************************************
 * Name: r_sci10_start
 *
 * Description:
 * Starts SCI10
 ****************************************************************************/

void r_sci10_start(void)
{
  IR(SCI10, TXI10)  = 0u;  /* Clear interrupt flag */
  IR(SCI10, RXI10)  = 0u;  /* Clear interrupt flag */
  IEN(SCI10, TXI10) = 1u;  /* Enable SCI interrupt */
  IEN(SCI10, RXI10) = 1u;  /* Enable SCI interrupt */
  ICU.GENAL0.BIT.EN8 = 1u;
  ICU.GENAL0.BIT.EN9 = 1u;
}

/****************************************************************************
 * Name: r_sci10_stop
 *
 * Description:
 * Stops SCI10
 ****************************************************************************/

void r_sci10_stop(void)
{
  SCI10.SCR.BIT.TE  = 0u;   /* Disable serial transmit */
  SCI10.SCR.BIT.RE  = 0u;   /* Disable serial receive */
  SCI10.SCR.BIT.TIE = 0u;   /* disable TXI interrupt */
  SCI10.SCR.BIT.RIE = 0u;   /* disable RXI and ERI interrupt */
  IEN(SCI10, TXI10)  = 0u;
  ICU.GENAL0.BIT.EN8 = 0u;
  IR(SCI10, TXI10)  = 0u;
  IEN(SCI10, RXI10) = 0u;
  ICU.GENAL0.BIT.EN9 = 0u;
  IR(SCI10, RXI10) = 0u;
}

/****************************************************************************
 * Name: r_sci10_serial_receive
 *
 * Description:
 * Receives SCI10
 ****************************************************************************/

MD_STATUS r_sci10_serial_receive(uint8_t * const rx_buf, uint16_t rx_num)
{
  if (1u > rx_num)
    {
      return MD_ARGERROR;
    }

  g_sci10_rx_count  = 0u;
  g_sci10_rx_length = rx_num;
  gp_sci10_rx_address = rx_buf;
  SCI10.SCR.BIT.RIE  = 1u;
  SCI10.SCR.BIT.RE   = 1u;
  return OK;
}
/****************************************************************************
 * Name: r_sci10_serial_send
 *
 * Description:
 * Transmits SCI10 data
 ****************************************************************************/

MD_STATUS r_sci10_serial_send(uint8_t * const tx_buf, uint16_t tx_num)
{
  if (1u > tx_num)
    {
      return MD_ARGERROR;
    }

  gp_sci10_tx_address = tx_buf;
  g_sci10_tx_count    = tx_num;

  /* Set TXD0 pin */

  SCI10.SCR.BIT.TIE = 1u;
  SCI10.SCR.BIT.TE  = 1u;
  return OK;
}
#endif

/****************************************************************************
 * Name: r_sci11_create
 *
 * Description:
 * Initializes SCI11 data
 ****************************************************************************/

#ifdef CONFIG_RX65N_SCI11
void r_sci11_create(void)
{
  rx_mpc_enable();
  MSTP(SCI11)   = 0u;                    /* Cancel SCI11 module stop state */
  IPR(SCI11, RXI11) = 15;                  /* Set interrupt priority */
  IPR(SCI11, TXI11) = 15;                  /* Set interrupt priority */
  SCI11.SCR.BYTE   = 0u;                  /* Clear the control register */

  /* Set clock enable */

  SCI11.SCR.BYTE         = _00_SCI_INTERNAL_SCK_UNUSED;
  SCI11.SIMR1.BIT.IICM   = 0u;                   /* Clear SIMR1.IICM bit */
  SCI11.SPMR.BIT.CKPH    = 0u;                   /* Clear SPMR.CKPH bit */
  SCI11.SPMR.BIT.CKPOL   = 0u;                   /* Clear SPMR.CKPOL bit */

  /* Set control registers */

  SCI11.SPMR.BYTE    = _00_SCI_RTS;
  SCI11.SMR.BYTE     = _00_SCI_CLOCK_PCLK | _00_SCI_STOP_1 |
                      _00_SCI_PARITY_DISABLE | _00_SCI_DATA_LENGTH_8 |
                      _00_SCI_MULTI_PROCESSOR_DISABLE |
                      _00_SCI_ASYNCHRONOUS_OR_I2C_MODE;
  SCI11.SCMR.BYTE    = _00_SCI_SERIAL_MODE | _00_SCI_DATA_LSB_FIRST |
                      _10_SCI_DATA_LENGTH_8_OR_7 | _62_SCI_SCMR_DEFAULT;
  SCI11.SEMR.BYTE    = _80_SCI_FALLING_EDGE_START_BIT |
                      _20_SCI_NOISE_FILTER_ENABLE |
                      _10_SCI_8_BASE_CLOCK | _40_SCI_BAUDRATE_DOUBLE |
                      _04_SCI_BIT_MODULATION_ENABLE;
  SCI11.SNFR.BYTE    = _00_SCI_ASYNC_DIV_1;

  /* Set SCI11 pin */

  sci11_init_port();
  rx_mpc_disable();
}

/****************************************************************************
 * Name: r_sci11_start
 *
 * Description:
 * Starts SCI11
 ****************************************************************************/

void r_sci11_start(void)
{
  IR(SCI11, TXI11) = 0u;   /* Clear interrupt flag */
  IR(SCI11, RXI11) = 0u;   /* Clear interrupt flag */
  IEN(SCI11, TXI11) = 1u;  /* Enable SCI interrupt */
  IEN(SCI11, RXI11) = 1u;  /* Enable SCI interrupt */
  ICU.GENAL0.BIT.EN12 = 1u;
  ICU.GENAL0.BIT.EN13 = 1u;
}

/****************************************************************************
 * Name: r_sci11_stop
 *
 * Description:
 * Stops SCI11
 ****************************************************************************/

void r_sci11_stop(void)
{
  SCI11.SCR.BIT.TE  = 0u;        /* Disable serial transmit */
  SCI11.SCR.BIT.RE  = 0u;        /* Disable serial receive */
  SCI11.SCR.BIT.TIE = 0u;        /* disable TXI interrupt */
  SCI11.SCR.BIT.RIE = 0u;        /* disable RXI and ERI interrupt */
  IEN(SCI11, TXI11)  = 0u;
  ICU.GENAL0.BIT.EN12 = 0u;
  IR(SCI11, TXI11)  = 0u;
  IEN(SCI11, RXI11) = 0u;
  ICU.GENAL0.BIT.EN13 = 0u;
  IR(SCI11, RXI11) = 0u;
}

/****************************************************************************
 * Name: r_sci11_serial_receive
 *
 * Description:
 * Receives SCI11 data
 ****************************************************************************/

MD_STATUS r_sci11_serial_receive(uint8_t * const rx_buf, uint16_t rx_num)
{
  if (1u > rx_num)
    {
      return MD_ARGERROR;
    }

  g_sci11_rx_count  = 0u;
  g_sci11_rx_length = rx_num;
  gp_sci11_rx_address = rx_buf;
  SCI11.SCR.BIT.RIE  = 1u;
  SCI11.SCR.BIT.RE   = 1u;
  return OK;
}

/****************************************************************************
 * Name: r_sci11_serial_send
 *
 * Description:
 * Transmit SCI11 data
 ****************************************************************************/

MD_STATUS r_sci11_serial_send(uint8_t * const tx_buf, uint16_t tx_num)
{
  if (1u > tx_num)
    {
      return MD_ARGERROR;
    }

  gp_sci11_tx_address = tx_buf;
  g_sci11_tx_count    = tx_num;

