apache/nuttx/arch/renesas/src/rx65n/rx65n_sci.c
  /* Set TXD1 pin */

  SCI11.SCR.BIT.TIE = 1u;
  SCI11.SCR.BIT.TE  = 1u;
  return OK;
}
#endif

/****************************************************************************
 * Name: r_sci12_create
 *
 * Description:
 * Initialize SCI12
 ****************************************************************************/

#ifdef CONFIG_RX65N_SCI12
void r_sci12_create(void)
{
  rx_mpc_enable();
  MSTP(SCI12)    = 0u;                   /* Cancel SCI12 module stop state */
  IPR(SCI12, RXI12) = 15;                  /* Set interrupt priority */
  IPR(SCI12, TXI12) = 15;                  /* Set interrupt priority */
  SCI12.SCR.BYTE  = 0u;                  /* Clear the control register */

  /* Set clock enable */

  SCI12.SCR.BYTE         = _00_SCI_INTERNAL_SCK_UNUSED;
  SCI12.SIMR1.BIT.IICM   = 0u;                   /* Clear SIMR1.IICM bit */
  SCI12.SPMR.BIT.CKPH    = 0u;                   /* Clear SPMR.CKPH bit */
  SCI12.SPMR.BIT.CKPOL   = 0u;                   /* Clear SPMR.CKPOL bit */

  /* Set control registers */

  SCI12.SPMR.BYTE   = _00_SCI_RTS;
  SCI12.SMR.BYTE    = _00_SCI_CLOCK_PCLK | _00_SCI_STOP_1 |
                     _00_SCI_PARITY_DISABLE | _00_SCI_DATA_LENGTH_8 |
                     _00_SCI_MULTI_PROCESSOR_DISABLE |
                     _00_SCI_ASYNCHRONOUS_OR_I2C_MODE;
  SCI12.SCMR.BYTE   = _00_SCI_SERIAL_MODE | _00_SCI_DATA_LSB_FIRST |
                     _10_SCI_DATA_LENGTH_8_OR_7 | _62_SCI_SCMR_DEFAULT;
  SCI12.SEMR.BYTE   = _80_SCI_FALLING_EDGE_START_BIT |
                     _20_SCI_NOISE_FILTER_ENABLE | _10_SCI_8_BASE_CLOCK |
                     _40_SCI_BAUDRATE_DOUBLE | _04_SCI_BIT_MODULATION_ENABLE;
  SCI12.SNFR.BYTE   = _00_SCI_ASYNC_DIV_1;

  /* Set SCI12 pin */

  sci12_init_port();
  rx_mpc_disable();
}

/****************************************************************************
 * Name: r_sci12_start
 *
 * Description:
 * Start SCI12
 ****************************************************************************/

void r_sci12_start(void)
{
  IR(SCI12, TXI12) = 0u;   /* Clear interrupt flag */
  IR(SCI12, RXI12) = 0u;   /* Clear interrupt flag */
  IEN(SCI12, TXI12) = 1u;  /* Enable SCI interrupt */
  IEN(SCI12, RXI12) = 1u;  /* Enable SCI interrupt */
  ICU.GENBL0.BIT.EN16 = 1u;
  ICU.GENBL0.BIT.EN17 = 1u;
}

/****************************************************************************
 * Name: r_sci12_stop
 *
 * Description:
 * Stops SCI12
 ****************************************************************************/

void r_sci12_stop(void)
{
  SCI12.SCR.BIT.TE  = 0u;   /* Disable serial transmit */
  SCI12.SCR.BIT.RE  = 0u;   /* Disable serial receive */
  SCI12.SCR.BIT.TIE = 0u;   /* disable TXI interrupt */
  SCI12.SCR.BIT.RIE = 0u;   /* disable RXI and ERI interrupt */
  IEN(SCI12, TXI12)  = 0u;
  ICU.GENBL0.BIT.EN16 = 0u;
  IR(SCI12, TXI12)  = 0u;
  IEN(SCI12, RXI12) = 0u;
  ICU.GENBL0.BIT.EN17 = 0u;
  IR(SCI12, RXI12) = 0u;
}

/****************************************************************************
 * Name: r_sci12_serial_receive
 *
 * Description:
 * Receives SCI12 data
 ****************************************************************************/

MD_STATUS r_sci12_serial_receive(uint8_t * const rx_buf, uint16_t rx_num)
{
  if (1u > rx_num)
    {
      return MD_ARGERROR;
    }

  g_sci12_rx_count  = 0u;
  g_sci12_rx_length = rx_num;
  gp_sci12_rx_address = rx_buf;
  SCI12.SCR.BIT.RIE = 1u;
  SCI12.SCR.BIT.RE  = 1u;
  return OK;
}

/****************************************************************************
 * Name: r_sci12_serial_send
 *
 * Description:
 * Send SCI12 data
 ****************************************************************************/

MD_STATUS r_sci12_serial_send(uint8_t * const tx_buf, uint16_t tx_num)
{
  if (1u > tx_num)
    {
      return MD_ARGERROR;
    }

  gp_sci12_tx_address = tx_buf;
  g_sci12_tx_count    = tx_num;

  /* Set TXD2 pin */

  SCI12.SCR.BIT.TIE = 1u;
  SCI12.SCR.BIT.TE  = 1u;
  return OK;
}
#endif
